[
  {
    "id": "uni_group",
    "type": "university",
    "title": "Dorm Group Chat",
    "openingParagraphs": [
      "The victim was found collapsed near the back gate of the university dorm at 2:14 AM. Hours before, they messaged the dorm group chat saying they felt followed, but no one replied. The message remained unread as they were later discovered unconscious beside their phone.",
      "You were the last person they privately contacted. To uncover what happened, you must access their phone and revisit the group chat — someone from that dorm circle might be hiding something."
    ],
    "passcodeHintParagraph": [
      "If I had to guess… students often use important personal dates. The victim’s student ID card in their wallet shows their date of birth: *June 21, 2004*. They always joked that they used it for everything — even their locker code.",
      "On their desk calendar, the date of the first dorm meeting — *September 5, 2023* — was circled in red. They mentioned once it was the day they met their roommate.",
      "Their favorite coffee shop stamp card had a number written on the back: *102706*. When asked, their friend said it was the date their scholarship was approved — *October 27, 2006*."
    ],
    "passcode": ["062104", "090523", "102706"],
    "motivation-keywords": ["jealousy", "betrayal", "revenge", "competition", "exclusion", "rumors"]
  },

  {
    "id": "office_group",
    "type": "office",
    "title": "After Hours at the Office",
    "openingParagraphs": [
      "The victim stayed late almost every night during the project deadline. Tension had grown in the team — disputes over workload, concerns about layoffs, and arguments about who would take responsibility if things fell apart.",
      "At 1:53 AM, the security guard found them unconscious in the meeting room. Their office phone kept receiving messages from the ‘Project-Final’ group. You've been granted temporary access to their device — the truth is somewhere in that chat history."
    ],
    "passcodeHintParagraph": [
      "Office folks usually rely on numbers they see every day. Their desk note shows the official *project kickoff date: November 25, 2023*. They used that date as the Wi-Fi password once — wouldn't be surprising if they reused it here.",
      "A sticky note under their keyboard reads: *Contract signed: March 14, 2022*. That was their first day at the company — they were proud of it.",
      "Their digital calendar reminder shows: *Performance review: January 9, 2024*. They highlighted it in green — the day they got their promotion."
    ],
    "passcode": ["112523", "031422", "010924"],
    "motivation-keywords": ["ambition", "deception", "pressure", "sabotage", "greed", "corruption"]
  },

  {
    "id": "village_line",
    "type": "neighborhood",
    "title": "The Neighborhood Line Group",
    "openingParagraphs": [
      "The neighborhood Line group used to be harmless — lost pets, garage sale posts, and the usual gossip. Recently, however, arguments escalated and neighbors grew distrustful of one another.",
      "Last night, the victim posted a blurry photo and wrote: “If anything happens to me, it’s someone from this group.” Minutes later, emergency sirens echoed outside their home. They are now in critical condition — and the answer lies somewhere in that chat."
    ],
    "passcodeHintParagraph": [
      "People at home rarely complicate their passwords. A sticky note on their fridge listed the date they moved into the house: *July 20, 2018*. It was circled twice — clearly important to them.",
      "In their garden journal, they wrote: *First harvest: August 12, 2020*. They loved their tomatoes and mentioned it often in the neighborhood chat.",
      "A framed photo of their dog has a date written on the back: *November 3, 2019* — the day they adopted them from the shelter."
    ],
    "passcode": ["072018", "081220", "110319"],
    "motivation-keywords": ["envy", "secrets", "grudges", "isolation", "property disputes", "generational conflict"]
  }
]